const translations = {
  en: {
    chooseLanguage: "Choose your language",
    carButtonTrigger: "Let's Go",
    dialogMessages: [
      "Hey there! Awesome to see you!",
      "My name’s Bob Dun, but you can just call me Boby.",
      "I'll be your sidekick and guide through the world of crypto.",
      "Stick with me and you’ll learn how to invest and trade safely.",
      "Tap the 'Let's Go' button if you're ready to uncover all the secrets!",
      "AWESOME! You're doing great! 💥",
      "Glad you're all set for this adventure!",
      "Now, I'll ask you a few quick questions to figure out your level.",
      "There'll be just a few test questions to help us find the best starting point for you.",
      "Ready? Smash that 'Take the Test' button!"

    ],
    nextButton: "Next",
    resultScoreText: "You scored {score} points.",
    resultLevels: {
      new: "Beginner",
      low: "Confident user",
      mid: "Almost a pro",
      high: "Crypto Genius"
    },
    resultDialogs: {
      new: [
        "You're just getting started.\nThat's awesome!",
        "I recommend kicking off with\nthe 'Basic Concepts' course.",
        "But you can pick\nany topic you like!"
      ],
      low: [
        "Not bad!\nYou already know a few things!", 
        "I recommend starting with\nthe 'Crypto Basics' course.", 
        "But you can choose\nany topic you want!"
      ],
      mid: [
        "Almost a pro! Nice job!", 
        "I'd suggest taking\nthe 'Trading & Investing' course.", 
        "But feel free\nto pick anything you like!"
      ],
      high: [
        "You're totally in the game! 🔥", 
        "I'd recommend jumping into\nthe 'Technical Analysis' course.", 
        "But you're free\nto choose any course you want!"
      ]
    }
  },
  ru: {
    chooseLanguage: "Выберите язык",
    carButtonTrigger: "Поехали",
    dialogMessages: [
      "Привет! Рад тебя видеть.",
      "Меня зовут Bob Dun, но можно просто Boby",
      "Я буду твоим помощником и гидом в мире криптовалют.",
      "Со мной ты научишься безопасно инвестировать и торговать.",
      "Нажми кнопку 'Поехали', если хочешь узнать все секреты",
      "КРУТО! Ты молодец 💥",
      "Рад, что ты готов к исследованиям!",
      "А сейчас я задам тебе пару вопросов, чтобы понять твой уровень.",
      "Всего будет несколько тестовых вопросов, которые помогут определить с чего нам начать.",
      "Готов? Жми 'Начать тест'!"
    ],
    nextButton: "Далее",
    resultScoreText: "Ты набрал {score} баллов.",
    resultLevels: {
      new: "Новичок",
      low: "Уверенный пользователь",
      mid: "Почти профи",
      high: "Гений крипты"
    },
    resultDialogs: {
      new: [
        "Ты только начинаешь.\nЭто отлично!",
        "Рекомендую начать\nс курса «Базовые понятия».",
        "Но ты можешь\nвыбрать любую тему!"
      ],
      low: [
        "Не плохо!\nТы уже кое-что знаешь!",
        "Рекомендую начать\nс курса «Основы крипты».",
        "Но ты можешь\nвыбрать любую тему!"
      ],
      mid: [
        "Почти профи! Круто!",
        "Советую пройти\n курс «Торговля и инвестиции».",
        "Но ты можешь\nвыбрать любой сам!"
      ],
      high: [
        "Ты явно в теме! 🔥",
        "Советую начать с\n курса «Технический анализ».",
        "Но ты волен\nвыбрать любой курс!"
      ]
    }
  },
  ua: {
    chooseLanguage: "Оберіть мову",
    carButtonTrigger: "Поїхали",
    dialogMessages: [
      "Привіт! Радий тебе бачити!",
      "Мене звати Bob Dun, але можеш просто Boby.",
      "Я буду твоїм помічником і гідом у світі криптовалюти.",
      "Разом зі мною ти навчишся безпечно інвестувати та торгувати.",
      "Тисни кнопку 'Поїхали', якщо хочеш дізнатися всі секрети!",
      "КРУТО! Ти молодець! 💥",
      "Радий, що ти готовий до пригод!",
      "А зараз я задам тобі кілька запитань, щоб зрозуміти твій рівень.",
      "Буде всього кілька тестових питань, які допоможуть визначити, з чого нам почати.",
      "Готовий? Жми 'Пройти тест'!"
    ],
    nextButton: "Далі",
    resultScoreText: "Ти набрав {score} балів.",
    resultLevels: {
      new: "Початківець",
      low: "Впевнений користувач",
      mid: "Майже профі",
      high: "Геній крипти"
    },
    resultDialogs: {
      new: [
        "Ти тільки починаєш.\nЦе круто!", 
        "Рекомендую почати\nз курсу «Базові поняття».", 
        "Але ти можеш\nобрати будь-яку тему!"
      ],
      low: [
        "Непогано!\nТи вже щось знаєш!", 
        "Рекомендую почати\nз курсу «Основи крипти».", 
        "Але ти можеш\nобрати будь-яку тему!"
      ],
      mid: [
        "Майже профі! Клас!", 
        "Раджу пройти\nкурс «Торгівля та інвестиції».", 
        "Але обирати\nтобі!"
      ],
      high: [
        "Ти реально в темі! 🔥", 
        "Раджу почати\nз курсу «Технічний аналіз».", 
        "Але вибір\nза тобою!"
      ]
    }
  }
};
